org/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-25 Tue 14:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git</title>
<meta name="author" content="Nilesh Suthar" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Git</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga5910e2">1. Workflow</a>
<ul>
<li><a href="#org1ef31f8">1.1. UAT Deployment</a></li>
<li><a href="#org6b8f700">1.2. Links</a></li>
</ul>
</li>
<li><a href="#org2248a47">2. Linus explaining revert</a></li>
<li><a href="#orgd5d17f6">3. Having multiple pre-releases</a>
<ul>
<li>
<ul>
<li><a href="#orgbd119eb">3.0.1. GitHub Releases and Tags</a></li>
<li><a href="#org64d6e9f">3.0.2. Versioning Strategy</a></li>
<li><a href="#org900175b">3.0.3. Practical Example</a></li>
<li><a href="#org56b4967">3.0.4. Summary</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga5910e2" class="outline-2">
<h2 id="orga5910e2"><span class="section-number-2">1.</span> Workflow</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1ef31f8" class="outline-3">
<h3 id="org1ef31f8"><span class="section-number-3">1.1.</span> UAT Deployment</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Feature branch has been merged/reviewed into develop branch through the github Pull Request
</p>

<p>
for UAT deployment the current develop branch will be merged into uat branch
</p>

<ol class="org-ol">
<li><p>
Create a release branch to start a deployment cylce
</p>

<p>
1.1. Pull changes
</p>
<pre class="example">
git pull upstream develop
</pre>

<p>
1.2. Checkout to uat branch
</p>
<pre class="example">
git checkout develop
</pre>

<p>
1.3. Checkout to the newly created branch
</p>
<pre class="example">
git checkout -b release/&lt;yyyy-mm-dd&gt;
</pre></li>

<li><p>
Release-oriented tasks
</p>

<p>
2.1. Building the source code
</p>
<pre class="example">
npm run build
</pre>
<p>
Above command is configured to create an optimized build of the source to be deployment on the cloud server.
</p>

<p>
2.2. Bug fixes
</p>
<pre class="example">
git add .
git commit -m "fix some bugs"
</pre>

<p>
2.3. Documentation generation
</p>
<pre class="example">
vi path/to/feature/folder/README.md
</pre>
<p>
You can add all the details about the code and it's working. All the functions, their parameters, and output You should example code blocks to show the intended usage. You can add warning and any known issues. This documentation is important for the next developer to continue where you left off.
</p></li>

<li><p>
Once it's ready to ship, the release branch gets merged into uat and tagged with a version number.
</p>

<p>
3.1. We create a tag with date (UAT should not have version and date of deployment should work)
</p>
<pre class="example">
git tag release/&lt;yyyy-mm-dd&gt;
git push --tags upstream
</pre>

<blockquote>
<p>
Once the release is ready to ship, it will get merged it into main and develop, then the release branch will be deleted. It’s important to merge back into develop because critical updates may have been added to the release branch and they need to be accessible to new features. If your organization stresses code review, this would be an ideal place for a pull request.
</p>
</blockquote>

<p>
3.2. In addition, it should be merged back into develop, which may have progressed since the release was initiated.
</p>
<pre class="example">
git checkout uat
git merge release/&lt;yyyy-mm-dd&gt;
</pre></li>
</ol>
</div>
</div>

<div id="outline-container-org6b8f700" class="outline-3">
<h3 id="org6b8f700"><span class="section-number-3">1.2.</span> Links</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://www.atlassian.com/git/tutorials/comparing-workflows/gitflow-workflow">Git flow tutorial</a>
</p>
</div>
</div>
</div>



<div id="outline-container-org2248a47" class="outline-2">
<h2 id="org2248a47"><span class="section-number-2">2.</span> Linus explaining revert</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://github.com/git/git/blob/master/Documentation/howto/revert-a-faulty-merge.txt#L62-L78">https://github.com/git/git/blob/master/Documentation/howto/revert-a-faulty-merge.txt#L62-L78</a>
</p>

<blockquote>
<p>
Reverting a regular commit just effectively undoes what that commit
did, and is fairly straightforward. But reverting a merge commit also
undoes the <span class="underline">data</span> that the commit changed, but it does absolutely
nothing to the effects on <span class="underline">history</span> that the merge had.
</p>

<p>
So the merge will still exist, and it will still be seen as joining
the two branches together, and future merges will see that merge as
the last shared state - and the revert that reverted the merge brought
in will not affect that at all.
</p>

<p>
So a "revert" undoes the data changes, but it's very much <span class="underline">not</span> an
"undo" in the sense that it doesn't undo the effects of a commit on
the repository history.
</p>

<p>
So if you think of "revert" as "undo", then you're going to always
miss this part of reverts. Yes, it undoes the data, but no, it doesn't
undo history.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgd5d17f6" class="outline-2">
<h2 id="orgd5d17f6"><span class="section-number-2">3.</span> Having multiple pre-releases</h2>
<div class="outline-text-2" id="text-3">
<p>
In a Git repository, you can have multiple pre-release versions. Pre-release versions are typically used to mark releases that are not yet considered stable and are often used for testing purposes, such as alpha, beta, or release candidate (RC) versions. Having multiple pre-releases allows you to track different stages of development and testing before a final release.
</p>
</div>

<div id="outline-container-orgbd119eb" class="outline-4">
<h4 id="orgbd119eb"><span class="section-number-4">3.0.1.</span> GitHub Releases and Tags</h4>
<div class="outline-text-4" id="text-3-0-1">
<p>
On platforms like GitHub, you can create multiple pre-release tags. When creating a release, you can mark it as a pre-release. Here's how it typically works:
</p>

<ol class="org-ol">
<li><b><b>Tagging Versions</b></b>: Each pre-release version should have a unique tag. For example:
<ul class="org-ul">
<li><code>v1.0.0-alpha</code></li>
<li><code>v1.0.0-beta</code></li>
<li><code>v1.0.0-rc1</code></li>
</ul></li>

<li><b><b>Creating Pre-Releases</b></b>: When creating a release on GitHub, you can check the "This is a pre-release" checkbox. This will differentiate it from stable releases.</li>

<li><b><b>Managing Multiple Pre-Releases</b></b>: You can have multiple pre-releases at the same time. For instance, you might have:
<ul class="org-ul">
<li>An alpha version for internal testing</li>
<li>A beta version for a wider audience testing</li>
<li>An RC version for final testing before the official release</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org64d6e9f" class="outline-4">
<h4 id="org64d6e9f"><span class="section-number-4">3.0.2.</span> Versioning Strategy</h4>
<div class="outline-text-4" id="text-3-0-2">
<p>
To manage multiple pre-releases, follow a consistent versioning strategy such as [Semantic Versioning (SemVer)](<a href="https://semver.org/">https://semver.org/</a>). According to SemVer, a pre-release version should have identifiers like <code>alpha</code>, `beta`, or `rc` along with a version number (e.g., `1.0.0-alpha.1`, `1.0.0-beta.2`, etc.).
</p>
</div>
</div>

<div id="outline-container-org900175b" class="outline-4">
<h4 id="org900175b"><span class="section-number-4">3.0.3.</span> Practical Example</h4>
<div class="outline-text-4" id="text-3-0-3">
<p>
Suppose you are working on version 1.0.0 of your software. Your pre-release versions might look like this:
</p>
<ul class="org-ul">
<li><code>v1.0.0-alpha.1</code>: First alpha release</li>
<li><code>v1.0.0-alpha.2</code>: Second alpha release</li>
<li><code>v1.0.0-beta.1</code>: First beta release</li>
<li><code>v1.0.0-beta.2</code>: Second beta release</li>
<li><code>v1.0.0-rc.1</code>: First release candidate</li>
<li><code>v1.0.0-rc.2</code>: Second release candidate</li>
</ul>

<p>
Each of these can be a separate pre-release in your repository.
</p>
</div>
</div>

<div id="outline-container-org56b4967" class="outline-4">
<h4 id="org56b4967"><span class="section-number-4">3.0.4.</span> Summary</h4>
<div class="outline-text-4" id="text-3-0-4">
<p>
Yes, you can and often should have multiple pre-releases in your repository to represent different stages of testing and stabilization. Each pre-release should be uniquely tagged and managed consistently to ensure clarity and proper version tracking.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-06-07</p>
<p class="author">Author: Nilesh Suthar</p>
<p class="date">Created: 2024-06-25 Tue 14:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
